In [1]:
# Import Libraries and Dependencies
import pandas as pd

### 1. Combine and Clean the Data
#### Import CSVs

In [4]:
# Read the CSV files into DataFrames.
sales_2020_df = pd.read_csv('athletic_sales_2020.csv')
sales_2021_df = pd.read_csv('athletic_sales_2021.csv')

In [7]:
# Display the 2020 sales DataFrame
sales_2020_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet

In [6]:
# Display the 2021 sales DataFrame
sales_2021_df.head()

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,65,750,487500,121875.00,Outlet
1,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,51,233,11883,3208.41,Outlet
2,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,50,275,137500,82500.00,Outlet
3,Kohl's,1189833,1/1/21,Midwest,Montana,Billings,Men's Apparel,47,77,3619,2714.25,Online
4,West Gear,1128299,1/1/21,West,California,San Francisco,Men's Athletic Footwear,64,225,14400,5184.00,Online

#### Check the data types of each DataFrame

In [8]:
# Check the 2020 sales data types.
sales_2020_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [9]:
# Check the 2021 sales data types.
sales_2021_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

#### Combine the sales data by rows.

In [25]:
# Combine the 2020 and 2021 sales DataFrames on the rows and reset the index.
combined_sales_df = pd.concat([sales_2020_df, sales_2021_df], ignore_index=True)
combined_sales_df

,retailer,retailer_id,invoice_date,region,state,city,product,price_per_unit,units_sold,total_sales,operating_profit,sales_method
0,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,50,1200,600000,300000.00,In-store
1,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,68,83,5644,2426.92,Online
2,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,75,275,206250,61875.00,Outlet
3,Foot Locker,1185732,1/1/20,Northeast,New York,New York,Men's Street Footwear,34,384,13056,6789.12,Outlet
4,Foot Locker,1185732,1/1/20,Northeast,Pennsylvania,Philadelphia,Women's Apparel,53,83,4399,1407.68,Outlet
...,...,...,...,...,...,...,...,...,...,...,...,...
9638,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,63,47,2961,1362.06,Online
9639,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,46,56,2576,1004.64,Outlet
9640,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,52,36,1872,692.64,Online
9641,Amazon,1185732,12/31/21,Northeast,Maine,Portland,Men's Apparel,55,125,68750,17187.50,Outlet
9642,Foot Locker,1185732,12/31/21,Northeast,Pennsylvania,Philadelphia,Men's Apparel,70,175,122500,42875.00,Outlet

In [26]:
# Check if any values are null.
combined_sales_df.isnull().mean() * 100

retailer            0.0
retailer_id         0.0
invoice_date        0.0
region              0.0
state               0.0
city                0.0
product             0.0
price_per_unit      0.0
units_sold          0.0
total_sales         0.0
operating_profit    0.0
sales_method        0.0
dtype: float64

In [27]:
# Check the data type of each column
combined_sales_df.dtypes

retailer             object
retailer_id           int64
invoice_date         object
region               object
state                object
city                 object
product              object
price_per_unit        int64
units_sold            int64
total_sales           int64
operating_profit    float64
sales_method         object
dtype: object

In [28]:
# Convert the "invoice_date" to a datetime datatype
combined_sales_df['invoice_date'] = pd.to_datetime(combined_sales_df['invoice_date'], format='%m/%d/%y')

In [29]:
# Confirm that the "invoice_date" data type has been changed.
combined_sales_df.dtypes

retailer                    object
retailer_id                  int64
invoice_date        datetime64[ns]
region                      object
state                       object
city                        object
product                     object
price_per_unit               int64
units_sold                   int64
total_sales                  int64
operating_profit           float64
sales_method                object
dtype: object

### 2. Determine which Region Sold the Most Products

#### Using `groupby`

In [33]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
units_sold_df = combined_sales_df[["region", "state", "city", "units_sold"]]
total_products_sold = units_sold_df.groupby(["region", "state", "city"]).sum()['units_sold'].reset_index()
total_products_sold.sort_values(by='units_sold', ascending=False, inplace=True)
total_products_sold = total_products_sold.rename(columns={'units_sold': 'Total_Products_Sold'})



# Show the top 5 results.
total_products_sold.head()

       region       state           city  Total_Products_Sold
21  Northeast    New York       New York               111954
33      South       Texas        Houston                90322
44       West  California  San Francisco                85478
43       West  California    Los Angeles                76384
34  Southeast     Florida          Miami                73135

#### Using `pivot_table`

In [37]:
# Show the number products sold for region, state, and city.
# Rename the sum to "Total_Products_Sold".
# Show the top 5 results.
pivot_products_sold = combined_sales_df.pivot_table(index=['region', 'state', 'city'], values='units_sold', aggfunc='sum').reset_index()
pivot_products_sold = pivot_products_sold.rename(columns={"units_sold": "Total_Products_Sold"})
pivot_products_sold = pivot_products_sold.sort_values(by='Total_Products_Sold', ascending=False)
pivot_products_sold.head()

       region       state           city  Total_Products_Sold
21  Northeast    New York       New York               111954
33      South       Texas        Houston                90322
44       West  California  San Francisco                85478
43       West  California    Los Angeles                76384
34  Southeast     Florida          Miami                73135

### 3. Determine which Region had the Most Sales

#### Using `groupby`

In [38]:
# Show the total sales for the products sold for each region, state, and city.
# Rename the "total_sales" column to "Total Sales"
total_sales_df = combined_sales_df.groupby(['region', 'state', 'city']).agg({'total_sales':'sum'}).reset_index()
total_sales_df.rename(columns={'total_sales':'Total Sales'}, inplace=True)
total_sales_df.sort_values(by='Total Sales', ascending=False, inplace=True)


# Show the top 5 results.
total_sales_df.head()

       region           state           city  Total Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

#### Using `pivot_table`

In [39]:
# Show the total sales for the products sold for each region, state, and city.
pivot_sales = combined_sales_df.pivot_table(index=['region', 'state', 'city'], values='total_sales', aggfunc='sum').reset_index()
pivot_sales = pivot_sales.rename(columns={"total_sales": "Total Sales"})
pivot_sales = pivot_sales.sort_values(by='Total Sales', ascending=False)

# Optional: Rename the "total_sales" column to "Total Sales"
pivot_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)

# Show the top 5 results.
pivot_sales.head()

       region           state           city  Total Sales
21  Northeast        New York       New York     39801235
44       West      California  San Francisco     33973228
34  Southeast         Florida          Miami     31600863
39  Southeast  South Carolina     Charleston     29285637
35  Southeast         Florida        Orlando     27682851

### 4. Determine which Retailer had the Most Sales

#### Using `groupby`

In [40]:
# Show the total sales for the products sold for each retailer, region, state, and city.
# Rename the "total_sales" column to "Total Sales"
retailer_sales_df = combined_sales_df.groupby(['retailer', 'region', 'state', 'city']).agg({'total_sales':'sum'}).reset_index()
retailer_sales_df.rename(columns={'total_sales':'Total Sales'}, inplace=True)
retailer_sales_df.sort_values(by='Total Sales', ascending=False, inplace=True)  


# Show the top 5 results.
retailer_sales_df.head()

        retailer     region           state           city  Total Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

#### Using `pivot_table`

In [41]:
# Show the total sales for the products sold for each retailer, region, state, and city.
pivot_retailer_sales = combined_sales_df.pivot_table(index=['retailer', 'region', 'state', 'city'], values='total_sales', aggfunc='sum').reset_index()


# Optional: Rename the "total_sales" column to "Total Sales"
pivot_retailer_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)
pivot_retailer_sales.sort_values(by='Total Sales', ascending=False, inplace=True)

# Show the top 5 results.
pivot_retailer_sales.head()

        retailer     region           state           city  Total Sales
103    West Gear       West      California  San Francisco     32794405
50        Kohl's       West      California    Los Angeles     25127160
22   Foot Locker  Northeast        New York       New York     25008568
109    West Gear       West      Washington        Seattle     24862675
33   Foot Locker  Southeast  South Carolina     Charleston     24822280

### 5. Determine which Retailer Sold the Most Women's Athletic Footwear

In [43]:
# Filter the sales data to get the women's athletic footwear sales data.
womens_sales_df = combined_sales_df[combined_sales_df['product'] == 'Women\'s Athletic Footwear']

#### Using `groupby`

In [44]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
womens_units_sold_df = womens_sales_df.groupby(['retailer', 'region', 'state', 'city']).agg({'units_sold':'sum'}).reset_index()
womens_units_sold_df.rename(columns={'units_sold':'Womens_Footwear_Units_Sold'}, inplace=True)
womens_units_sold_df.sort_values(by='Womens_Footwear_Units_Sold', ascending=False, inplace=True)

# Show the top 5 results.
womens_units_sold_df.head()

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

#### Using `pivot_table`

In [45]:
# Show the total number of women's athletic footwear sold for each retailer, region, state, and city.
pivot_womens_units_sold = womens_sales_df.pivot_table(index=['retailer', 'region', 'state', 'city'], values='units_sold', aggfunc='sum').reset_index()


# Rename the "units_sold" column to "Womens_Footwear_Units_Sold"
pivot_womens_units_sold.rename(columns={'units_sold': 'Womens_Footwear_Units_Sold'}, inplace=True)
pivot_womens_units_sold.sort_values(by='Womens_Footwear_Units_Sold', ascending=False, inplace=True)

# Show the top 5 results.
pivot_womens_units_sold.head()

,retailer,region,state,city,Womens_Footwear_Units_Sold
101,West Gear,West,California,San Francisco,12107
22,Foot Locker,Northeast,New York,New York,10996
49,Kohl's,West,California,Los Angeles,10826
33,Foot Locker,Southeast,South Carolina,Charleston,8814
68,Sports Direct,South,Texas,Dallas,8790

### 5. Determine the Day with the Most Women's Athletic Footwear Sales

In [48]:
# Create a pivot table with the 'invoice_date' column is the index, and the "total_sales" as the values.
pivot_womens_daily_sales = womens_sales_df.pivot_table(index='invoice_date', values='total_sales', aggfunc='sum').reset_index()


# Optional: Rename the "total_sales" column to "Total Sales"
pivot_womens_daily_sales.rename(columns={'total_sales': 'Total Sales'}, inplace=True)
pivot_womens_daily_sales.sort_values(by='Total Sales', ascending=False, inplace=True)


# Show the table.
pivot_womens_daily_sales.head(10)

    invoice_date  Total Sales
227   2021-07-16      1521825
344   2021-12-16      1473497
206   2021-06-17      1376988
250   2021-08-17      1086294
233   2021-07-23      1021806
323   2021-11-17      1021145
338   2021-12-09       915011
212   2021-06-24       884238
221   2021-07-09       869054
244   2021-08-10       839120

In [50]:
# Resample the pivot table into daily bins, and get the total sales for each day.
resampled_womens_daily_sales = pivot_womens_daily_sales.resample('D', on='invoice_date').sum().reset_index()



# Sort the resampled pivot table in ascending order on "Total Sales".
resampled_womens_daily_sales.sort_values(by='Total Sales', ascending=False, inplace=True)
resampled_womens_daily_sales.head(10)

    invoice_date  Total Sales
559   2021-07-16      1521825
712   2021-12-16      1473497
530   2021-06-17      1376988
591   2021-08-17      1086294
566   2021-07-23      1021806
683   2021-11-17      1021145
705   2021-12-09       915011
537   2021-06-24       884238
552   2021-07-09       869054
584   2021-08-10       839120

### 6.  Determine the Week with the Most Women's Athletic Footwear Sales

In [51]:
# Resample the pivot table into weekly bins, and get the total sales for each week.
resampled_womens_weekly_sales = pivot_womens_daily_sales.resample('W', on='invoice_date').sum().reset_index()



# Sort the resampled pivot table in ascending order on "Total Sales".
resampled_womens_weekly_sales.sort_values(by='Total Sales', ascending=False, inplace=True)
resampled_womens_weekly_sales.head(10)

    invoice_date  Total Sales
102   2021-12-19      3098970
101   2021-12-12      2922161
79    2021-07-11      2835078
80    2021-07-18      2801449
97    2021-11-14      2531721
85    2021-08-22      2491259
84    2021-08-15      2463941
98    2021-11-21      2449537
71    2021-05-16      2422132
75    2021-06-13      2358602